In [1]:

import pandas as pd
from pathlib import Path

excel_path = Path(r"/Users/cheickberthe/PycharmProjects/spreadsheet-analyzer/test_assets/collection/business-accounting/Business Accounting.xlsx")
df = pd.read_excel(excel_path, sheet_name=1)
print(f"Loaded sheet with shape: {df.shape}")

# Quick preview for LLM context
print("\nFirst 10 rows:")
print(df.head(10).to_string())
print("\nLast 5 rows:")
print(df.tail(5).to_string())

# Get basic info
sheet_name = "None"
sheet_dimensions = f"{df.shape[0]} rows x {df.shape[1]} columns"

Loaded sheet with shape: (769, 11)

First 10 rows:
        Date                           Description  Transaction type   USD Amount     XOF Amount   Unnamed: 5              Category   TOTAL REVENUES   84202.53   TOTAL EXPENSES  -385526.333434
0 2023-01-03                        iCloud Storage               EXP        -9.99   -6214.329474   622.055002                   NaN              NaN        NaN              NaN             NaN
1 2023-01-03                   Amazon web services               EXP      -284.83 -177179.926325   622.055002                   NaN              NaN        NaN              NaN             NaN
2 2023-01-03                Diesel for return trip               EXP      -526.48    -327,500CFA          NaN                  Fuel              NaN        NaN              NaN             NaN
3 2023-01-03                         Road expenses               EXP      -120.57     -75,000CFA          NaN             Toll Fees              NaN        NaN              NaN             NaN
4 2023-01-03                  Technical Inspection               EXP       -80.38     -50,000CFA          NaN       Regulatory Fees              NaN        NaN              NaN             NaN
5 2023-01-03                 2 x Shell oil bottles               EXP      -176.83    -110,000CFA          NaN  Maintenance Supplies              NaN        NaN              NaN             NaN
6 2023-01-03                    3 x oil cartridges               EXP       -48.23     -30,000CFA          NaN  Maintenance Supplies              NaN        NaN              NaN             NaN
7 2023-01-03  Discount on oil bottle and cartridge               REV        16.08      10,000CFA          NaN  Discount on Supplies              NaN        NaN              NaN             NaN
8 2023-01-03                          Travel bonus               EXP       -24.11     -15,000CFA          NaN               Bonuses              NaN        NaN              NaN             NaN
9 2023-01-03           Issiaka Diallo debt payment               EXP       -80.38     -50,000CFA          NaN       Debt Repayments              NaN        NaN              NaN             NaN

Last 5 rows:
          Date                        Description  Transaction type   USD Amount    XOF Amount   Unnamed: 5         Category   TOTAL REVENUES   84202.53   TOTAL EXPENSES  -385526.333434
764 2023-12-31  NY Doordash dinner - Woke Noodles               EXP       -57.77 -34293.788136   593.626244              NaN              NaN        NaN              NaN             NaN
765 2023-12-31               JFK Cart rental fees               EXP        -6.53  -3876.379376   593.626244              NaN              NaN        NaN              NaN             NaN
766 2023-12-31      Purchase of Mercedes SK Truck               EXP     -7580.53           NaN          NaN   Truck Purchase              NaN        NaN              NaN             NaN
767 2023-12-31               Yaya December salary               EXP      -168.46           NaN          NaN  Salary Payments              NaN        NaN              NaN             NaN
768 2023-12-31               2 x 150Amp batteries               EXP      -286.38           NaN          NaN     Repair Parts              NaN        NaN              NaN             NaN

In [2]:

excel_file_name = excel_path.name
sheet_dimensions = f"{df.shape[0]} rows x {df.shape[1]} columns"
sheet_name

'None'

In [3]:

# Table Detection Analysis
print("=== DATA STRUCTURE ANALYSIS ===")
print(f"DataFrame shape: {df.shape}")
print(f"Columns: {list(df.columns)}")
print("\n=== FIRST 10 ROWS ===")
print(df.head(10).to_string())
print("\n=== LAST 5 ROWS ===")
print(df.tail(5).to_string())

print("\n=== COLUMN ANALYSIS ===")
# Check for empty columns that might separate tables
for i, col in enumerate(df.columns):
    non_null_count = df[col].notna().sum()
    print(f"Column {i} ('{col}'): {non_null_count}/{len(df)} non-null values")

print("\n=== EMPTY ROW ANALYSIS ===")
# Check for empty rows that might separate tables
empty_rows = df.isnull().all(axis=1)
if empty_rows.any():
    empty_row_indices = empty_rows[empty_rows].index.tolist()
    print(f"Empty rows found at indices: {empty_row_indices[:10]}")
else:
    print("No completely empty rows found")

print("\n=== SIDE-BY-SIDE ANALYSIS ===")
# Check for potential side-by-side tables by examining column groups
left_cols = df.iloc[:, 0:7]  # First 7 columns
right_cols = df.iloc[:, 7:]  # Remaining columns
print(f"Left section shape: {left_cols.shape}")
print(f"Right section shape: {right_cols.shape}")
print(f"Left section non-null density: {left_cols.notna().sum().sum() / (left_cols.shape[0] * left_cols.shape[1]):.2f}")
print(f"Right section non-null density: {right_cols.notna().sum().sum() / (right_cols.shape[0] * right_cols.shape[1]):.2f}")

=== DATA STRUCTURE ANALYSIS ===
DataFrame shape: (769, 11)
Columns: ['Date', 'Description', 'Transaction type', 'USD Amount', 'XOF Amount', 'Unnamed: 5', 'Category', 'TOTAL REVENUES', 84202.53000000001, 'TOTAL EXPENSES', -385526.33343393693]

=== FIRST 10 ROWS ===
        Date                           Description  Transaction type   USD Amount     XOF Amount   Unnamed: 5              Category   TOTAL REVENUES   84202.53   TOTAL EXPENSES  -385526.333434
0 2023-01-03                        iCloud Storage               EXP        -9.99   -6214.329474   622.055002                   NaN              NaN        NaN              NaN             NaN
1 2023-01-03                   Amazon web services               EXP      -284.83 -177179.926325   622.055002                   NaN              NaN        NaN              NaN             NaN
2 2023-01-03                Diesel for return trip               EXP      -526.48    -327,500CFA          NaN                  Fuel              NaN        NaN              NaN             NaN
3 2023-01-03                         Road expenses               EXP      -120.57     -75,000CFA          NaN             Toll Fees              NaN        NaN              NaN             NaN
4 2023-01-03                  Technical Inspection               EXP       -80.38     -50,000CFA          NaN       Regulatory Fees              NaN        NaN              NaN             NaN
5 2023-01-03                 2 x Shell oil bottles               EXP      -176.83    -110,000CFA          NaN  Maintenance Supplies              NaN        NaN              NaN             NaN
6 2023-01-03                    3 x oil cartridges               EXP       -48.23     -30,000CFA          NaN  Maintenance Supplies              NaN        NaN              NaN             NaN
7 2023-01-03  Discount on oil bottle and cartridge               REV        16.08      10,000CFA          NaN  Discount on Supplies              NaN        NaN              NaN             NaN
8 2023-01-03                          Travel bonus               EXP       -24.11     -15,000CFA          NaN               Bonuses              NaN        NaN              NaN             NaN
9 2023-01-03           Issiaka Diallo debt payment               EXP       -80.38     -50,000CFA          NaN       Debt Repayments              NaN        NaN              NaN             NaN

=== LAST 5 ROWS ===
          Date                        Description  Transaction type   USD Amount    XOF Amount   Unnamed: 5         Category   TOTAL REVENUES   84202.53   TOTAL EXPENSES  -385526.333434
764 2023-12-31  NY Doordash dinner - Woke Noodles               EXP       -57.77 -34293.788136   593.626244              NaN              NaN        NaN              NaN             NaN
765 2023-12-31               JFK Cart rental fees               EXP        -6.53  -3876.379376   593.626244              NaN              NaN        NaN              NaN             NaN
766 2023-12-31      Purchase of Mercedes SK Truck               EXP     -7580.53           NaN          NaN   Truck Purchase              NaN        NaN              NaN             NaN
767 2023-12-31               Yaya December salary               EXP      -168.46           NaN          NaN  Salary Payments              NaN        NaN              NaN             NaN
768 2023-12-31               2 x 150Amp batteries               EXP      -286.38           NaN          NaN     Repair Parts              NaN        NaN              NaN             NaN

=== COLUMN ANALYSIS ===
Column 0 ('Date'): 769/769 non-null values
Column 1 ('Description'): 769/769 non-null values
Column 2 ('Transaction type'): 769/769 non-null values
Column 3 ('USD Amount'): 769/769 non-null values
Column 4 ('XOF Amount'): 698/769 non-null values
Column 5 ('Unnamed: 5'): 264/769 non-null values
Column 6 ('Category'): 477/769 non-null values
Column 7 ('TOTAL REVENUES'): 0/769 non-null values
Column 8 ('84202.53000000001'): 0/769 non-null values
Column 9 ('TOTAL EXPENSES'): 0/769 non-null values
Column 10 ('-385526.33343393693'): 0/769 non-null values

=== EMPTY ROW ANALYSIS ===
No completely empty rows found

=== SIDE-BY-SIDE ANALYSIS ===
Left section shape: (769, 7)
Right section shape: (769, 4)
Left section non-null density: 0.84
Right section non-null density: 0.00

In [4]:
df.head()

,Date,Description,Transaction type,USD Amount,XOF Amount,Unnamed: 5,Category,TOTAL REVENUES,84202.53,TOTAL EXPENSES,-385526.333434
0,2023-01-03,iCloud Storage,EXP,-9.99,-6214.329474,622.055002,NaN,NaN,NaN,NaN,NaN
1,2023-01-03,Amazon web services,EXP,-284.83,-177179.926325,622.055002,NaN,NaN,NaN,NaN,NaN
2,2023-01-03,Diesel for return trip,EXP,-526.48,"-327,500CFA",NaN,Fuel,NaN,NaN,NaN,NaN
3,2023-01-03,Road expenses,EXP,-120.57,"-75,000CFA",NaN,Toll Fees,NaN,NaN,NaN,NaN
4,2023-01-03,Technical Inspection,EXP,-80.38,"-50,000CFA",NaN,Regulatory Fees,NaN,NaN,NaN,NaN

In [5]:
df.tail()

,Date,Description,Transaction type,USD Amount,XOF Amount,Unnamed: 5,Category,TOTAL REVENUES,84202.53,TOTAL EXPENSES,-385526.333434
764,2023-12-31,NY Doordash dinner - Woke Noodles,EXP,-57.77,-34293.788136,593.626244,NaN,NaN,NaN,NaN,NaN
765,2023-12-31,JFK Cart rental fees,EXP,-6.53,-3876.379376,593.626244,NaN,NaN,NaN,NaN,NaN
766,2023-12-31,Purchase of Mercedes SK Truck,EXP,-7580.53,NaN,NaN,Truck Purchase,NaN,NaN,NaN,NaN
767,2023-12-31,Yaya December salary,EXP,-168.46,NaN,NaN,Salary Payments,NaN,NaN,NaN,NaN
768,2023-12-31,2 x 150Amp batteries,EXP,-286.38,NaN,NaN,Repair Parts,NaN,NaN,NaN,NaN

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 769 entries, 0 to 768
Data columns (total 11 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Date                 769 non-null    datetime64[ns]
 1   Description          769 non-null    object
 2   Transaction type     769 non-null    object
 3   USD Amount           769 non-null    float64
 4   XOF Amount           698 non-null    object
 5   Unnamed: 5           264 non-null    float64
 6   Category             477 non-null    object
 7   TOTAL REVENUES       0 non-null      float64
 8   84202.53000000001    0 non-null      float64
 9   TOTAL EXPENSES       0 non-null      float64
 10  -385526.33343393693  0 non-null      float64
dtypes: datetime64[ns](1), float64(6), object(4)
memory usage: 66.2+ KB

In [7]:
# Identify blocks separated by empty rows
empty_rows = df.isnull().all(axis=1)
empty_row_indices = empty_rows[empty_rows].index.tolist()

# Look for consecutive empty rows (2+ indicate table boundary)
# Empty columns can also indicate horizontal table separation

In [8]:
# Analyze column patterns and entity types
left_cols = df.iloc[:, 0:7]  # First potential table
right_cols = df.iloc[:, 7:]  # Second potential table

# Check for different header patterns or data types
left_cols_info = left_cols.dtypes
right_cols_info = right_cols.dtypes

left_cols_info, right_cols_info

(Date                datetime64[ns]
 Description                 object
 Transaction type            object
 USD Amount                 float64
 XOF Amount                  object
 Unnamed: 5                 float64
 Category                    object
 dtype: object,
  TOTAL REVENUES    float64
  84202.53          float64
  TOTAL EXPENSES    float64
 -385526.333434     float64
 dtype: object)

In [9]:

# Extract detection results created by LLM
# The detector should have created a 'detected_tables' variable with the results

# Check if the LLM created the expected variable
if 'detected_tables' in globals():
    # Return the detected tables
    detection_results = detected_tables
    print(f"Found {len(detection_results)} tables from LLM detection")
else:
    # If no detection was made, return empty list to trigger fallback
    print("No 'detected_tables' variable found - LLM may not have completed detection")
    detection_results = []

detection_results

No 'detected_tables' variable found - LLM may not have completed detection

[]

In [10]:
df_shape = df.shape; df_shape

(769, 11)


# Table Detection Results

Detected 1 tables:


## Table 1: Full spreadsheet (fallback)
- Location: Rows 0-768, Columns 0-10
- Type: detail
- Entity: data
- Confidence: 0.50